tap 'Homebrew/bundle'

# vm
brew 'docker'
brew 'docker-compose'
brew 'hyperkit'
cask 'orbstack'

brew 'colima'
brew 'dive'
brew 'minikube'

# google
cask 'google-cloud-sdk'

# aws
brew 'awscli'
cask 'aws-vault'
brew 'keidarcy/tap/e1s'
brew 'amazon-ecs-cli'
#brew 'terraform'
brew 'terraform_landscape'
brew 'warrensbox/tap/tfswitch'
brew 'terraformer'
brew 'tflint'
cask 'cyberduck'

# dev
brew 'autojump'
brew 'ast-grep'
brew 'cmake'
brew 'ctags'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'gitmoji'
brew 'icu4c'
brew 'jq'
brew 'nkf'
brew 'openapi-generator'
brew 'oven-sh/bun/bun'
brew 'peco'
brew 'rg'
brew 's3cmd'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'gettext'

cask 'iterm2'

# AI
cask 'claude'
brew 'claude-squad'
brew 'ollama'
cask 'aqua-voice'
cask 'lm-studio'

# ops
brew 'derailed/k9s/k9s'
brew 'pwgen'
brew 'telnet'

# zsh
brew 'zsh'
brew 'zsh-completions'

# go
brew 'go'

# java
brew 'java'

# JavaScript
#brew 'node'
brew 'nodebrew'
brew 'pnpm'
brew 'yarn'
brew 'jsdoc3'

# python
brew 'python'
brew 'pyenv'
brew 'pipx'
brew 'uv'

# ruby
brew 'rbenv'
brew 'ruby-build'

# rust
brew 'rust'

# docs
brew 'doxygen'
brew 'graphviz'

# editor
brew 'vim'
cask 'visual-studio-code'
cask 'cursor'
cask 'windsurf'

# test
cask 'postman'

# browser
cask 'firefox'
cask 'google-chrome'
cask 'google-japanese-ime'

# mobile
brew 'expo-orbit'

# db
brew 'postgresql'
brew 'redis'
tap 'mongodb/brew'
brew 'mongodb-community'
brew 'mongodb-database-tools'
cask 'mongodb-compass'

# lang
brew 'mecab'
brew 'mecab-ipadic'

# tools
brew 'terminal-notifier'
cask 'bitwarden'
cask 'deepl'
cask 'figma'
cask 'karabiner-elements'
cask 'hammerspoon'
cask 'notion'
cask 'notion-calendar'
cask 'raycast'
cask 'session-manager-plugin'
cask 'slack'

# image
brew 'imagemagick'
brew 'exiftool'
brew 'webp'
cask 'imageoptim'

# video
brew 'ffmpeg'

# font
tap 'sanemat/font'
#brew 'ricty', args: ['powerline', 'vim-powerline']

# Stripe
brew 'stripe/stripe-cli/stripe'
