tap 'Homebrew/bundle'
tap 'homebrew/cask-versions'

# vm
brew 'docker'
brew 'docker-compose'
brew 'hyperkit'
cask 'orbstack'

brew 'colima'
brew 'dive'
brew 'minikube'
cask 'vagrant'
cask 'virtualbox'

# google
cask 'google-cloud-sdk'

# aws
brew 'awscli'
cask 'aws-vault'
brew 'keidarcy/tap/e1s'
brew 'amazon-ecs-cli'
brew 'kayac/tap/ecspresso'
#brew 'terraform'
brew 'terraform_landscape'
brew 'warrensbox/tap/tfswitch'
brew 'terraformer'
brew 'tflint'
cask 'cyberduck'

# dev
brew 'autojump'
brew 'ast-grep'
brew 'cmake'
brew 'ctags'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'gitmoji'
brew 'icu4c'
brew 'jq'
brew 'nkf'
brew 'openapi-generator'
brew 'peco'
brew 's3cmd'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'gettext'

cask 'iterm2'

# ops
brew 'circleci'
brew 'pwgen'
brew 'telnet'
brew 'vault'

# zsh
brew 'zsh'
brew 'zsh-completions'

# go
brew 'go'

# JavaScript
#brew 'node'
brew 'nodebrew'
brew 'pnpm'
brew 'yarn'
brew 'jsdoc3'

# python
brew 'python'
brew 'pyenv'

# ruby
brew 'rbenv'
brew 'ruby-build'


# docs
brew 'doxygen'
brew 'graphviz'

# editor
brew 'vim'
cask 'visual-studio-code'

# test
cask 'browserstacklocal'
cask 'postman'

# browser
cask 'firefox'
cask 'google-chrome'
cask 'google-japanese-ime'

# db
brew 'postgresql'
brew 'redis'
tap 'mongodb/brew'
brew 'mongodb-community'
brew 'mongodb-database-tools'

# data
tap 'fishtown-analytics/dbt'
brew 'dbt'
brew 'embulk'

# lang
brew 'mecab'
brew 'mecab-ipadic'

# tools
cask 'alfred'
cask 'bitwarden'
cask 'cursor'
cask 'deepl'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'kindle'
cask 'hammerspoon'
cask 'notion'
cask 'raycast'
cask 'session-manager-plugin'
cask 'slack'
cask 'tandem'

# image
brew 'imagemagick'
brew 'exiftool'
brew 'webp'
cask 'imageoptim'

# video
brew 'ffmpeg'

# font
tap 'sanemat/font'
#brew 'ricty', args: ['powerline', 'vim-powerline']

# PaaS
brew 'heroku/brew/heroku'
tap 'cloudfoundry/tap'
brew 'cf-cli'

# Mac App Store
brew 'mas'
mas 'ToyViewer ', id: 414298354

# Jira
tap 'ankitpokhrel/jira-cli'
brew 'jira-cli'
mas 'Jira Cloud by Atlassian', id: 1475897096

# Stripe
brew 'stripe/stripe-cli/stripe'
