tap 'Homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/versions'

# vm
brew 'docker'
cask 'docker'
cask 'vagrant'
cask 'virtualbox'

# google
cask 'google-cloud-sdk'

# aws
brew 'awscli'
brew 'amazon-ecs-cli'
brew 'terraform'
brew 'terraformer'
cask 'cyberduck'

# dev
brew 'autojump'
brew 'cmake'
brew 'ctags'
brew 'git'
brew 'icu4c'
brew 'jq'
brew 'nkf'
brew 'peco'
brew 's3cmd'
brew 'tmux'
brew 'tree'
brew 'gettext'

cask 'iterm2'

# ops
brew 'pwgen'
brew 'telnet'

# zsh
brew 'zsh'
brew 'zsh-completions'

# go
brew 'go'

# JavaScript
#brew 'node'
brew 'nodebrew'
brew 'yarn'

# python
brew 'python'

# ruby
brew 'rbenv'
brew 'ruby-build'


# docs
brew 'doxygen'
brew 'graphviz'

# editor
brew 'vim'
#cask 'atom'
cask 'visual-studio-code'

# test
cask 'insomnia'

# browser
cask 'firefox'
cask 'google-chrome'
cask 'google-japanese-ime'

# db
brew 'postgresql'
brew 'redis'
tap 'mongodb/brew'
brew 'mongodb-community'

# lang
brew 'mecab'
brew 'mecab-ipadic'

# tools
cask 'alfred'
cask 'clipy'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'kindle'
cask 'shiftit'
cask 'slack'
cask 'taskade'

# image
brew 'imagemagick'
brew 'exiftool'
brew 'webp'
cask 'imageoptim'

# font
tap 'sanemat/font'
brew 'ricty', args: ['powerline', 'vim-powerline']

# PaaS
brew 'heroku/brew/heroku'
tap 'cloudfoundry/tap'
brew 'cf-cli'

# win
brew 'wine'

